simonnkm/Ambiance/Ambiance-main/WPSSource/WildlifeSource/STM32_BLE/App/app_ble.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    app_ble.c
  * @author  GPM WBL Application Team
  * @brief   BLE Application
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
#include "main.h"
#include "stm32wb0x.h"
#include "ble.h"
#include "gatt_profile.h"
#include "gap_profile.h"
#include "app_ble.h"
#include "stm32wb0x_hal_radio_timer.h"
#include "bleplat.h"
#include "nvm_db.h"
#include "blenvm.h"
#include "pka_manager.h"
#include "stm32_seq.h"
#include "usart.h"
#include "usart_app.h"
/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/**
 * Security parameters structure
 */
typedef struct
{
  /**
   * IO capability of the device
   */
  uint8_t ioCapability;

  /**
   * Authentication requirement of the device
   * Man In the Middle protection required?
   */
  uint8_t mitm_mode;

  /**
   * bonding mode of the device
   */
  uint8_t bonding_mode;

  /**
   * minimum encryption key size requirement
   */
  uint8_t encryptionKeySizeMin;

  /**
   * maximum encryption key size requirement
   */
  uint8_t encryptionKeySizeMax;

  /**
   * this flag indicates whether the host has to initiate
   * the security, wait for pairing or does not have any security
   * requirements.
   * 0x00 : no security required
   * 0x01 : host should initiate security by sending the security
   *        request command
   * 0x02 : host need not send the clave security request but it
   * has to wait for paiirng to complete before doing any other
   * processing
   */
  uint8_t initiateSecurity;
  /* USER CODE BEGIN tSecurityParams*/

  /* USER CODE END tSecurityParams */
}SecurityParams_t;

/**
 * Global context contains all BLE common variables.
 */
typedef struct
{
  /**
   * security requirements of the host
   */
  SecurityParams_t bleSecurityParam;

  /**
   * gap service handle
   */
  uint16_t gapServiceHandle;

  /**
   * device name characteristic handle
   */
  uint16_t devNameCharHandle;

  /**
   * appearance characteristic handle
   */
  uint16_t appearanceCharHandle;

  /**
   * connection handle of the current active connection
   * When not in connection, the handle is set to 0xFFFF
   */
  uint16_t connectionHandle;
  /* USER CODE BEGIN BleGlobalContext_t*/

  /* USER CODE END BleGlobalContext_t */
}BleGlobalContext_t;

typedef struct
{
  BleGlobalContext_t BleApplicationContext_legacy;
  APP_BLE_ConnStatus_t Device_Connection_Status;
  /* USER CODE BEGIN PTD_1*/

  /* USER CODE END PTD_1 */
}BleApplicationContext_t;

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */
/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */
/* Private variables ---------------------------------------------------------*/

NO_INIT(uint32_t dyn_alloc_a[BLE_DYN_ALLOC_SIZE>>2]);

static BleApplicationContext_t bleAppContext;

USART_APP_ConnHandleNotEvt_t USARTHandleNotification;

/* Device name is now built at runtime as "Ambiance Speaker XXXXXX", where
 * XXXXXX is a 6-hex-digit (24-bit) tag derived from this chip's factory-
 * programmed 64-bit unique ID (see BLE_BuildDeviceName()). Every unit
 * previously advertised the same fixed name AND the same fixed BD address
 * (CFG_PUBLIC_BD_ADDRESS in app_conf.h), so BLE scanners deduplicated
 * multiple nearby speakers into a single entry. The address fix (switch to
 * HCI_ADDR_STATIC_RANDOM_ADDR) makes each unit discoverable as a distinct
 * device; this name suffix makes them distinguishable at a glance in the
 * GUI's device list too.
 * Widened from 4 to 6 hex digits (16 to 24 bits) after two genuinely
 * different boards were confirmed to have collided on the same 4-digit tag -
 * with only 65536 possible 4-digit tags, a birthday-paradox collision was
 * already plausible well before a 300-unit fleet. 24 bits (16.7M buckets)
 * pushes that same 50% collision point out to roughly a 4800-unit fleet.
 * The bracketed BLE address shown alongside the name in the GUI is still the
 * one truly guaranteed-unique identifier regardless of tag width. */
#define GAP_DEVICE_NAME_PREFIX   "Ambiance Speaker "
#define GAP_DEVICE_NAME_ID_LEN   6U   /* hex chars appended from the unique chip ID */
#define GAP_DEVICE_NAME_LEN      (sizeof(GAP_DEVICE_NAME_PREFIX) - 1U + GAP_DEVICE_NAME_ID_LEN)

static uint8_t a_GapDeviceName[GAP_DEVICE_NAME_LEN]; /* Gap Device Name, filled in by BLE_BuildDeviceName() */

/* TEMP DIAGNOSTIC: last BD address BLE_Init() derived/wrote for this chip
 * (STATIC_RANDOM_ADDR path only). Exposed via BLE_GetAddress() so
 * ButtonsMenuSM.c can show it on the OLED at boot - a way to confirm two
 * physical units actually have different addresses without needing any
 * UART (the debug trace UART shares a wire with the real GUI-comm
 * protocol, so printf-based tracing isn't safe to use for this). Safe to
 * remove, along with the OLED screen and this declaration, once confirmed. */
static uint8_t s_bleAddress[6] = {0};

void BLE_GetAddress(uint8_t out[6])
{
  memcpy(out, s_bleAddress, 6);
}

/**
 * Advertising Data
 */
uint8_t a_AdvData[3U + 2U + GAP_DEVICE_NAME_LEN] =
{
  2, AD_TYPE_FLAGS, FLAG_BIT_LE_GENERAL_DISCOVERABLE_MODE|FLAG_BIT_BR_EDR_NOT_SUPPORTED,
  1 + GAP_DEVICE_NAME_LEN, AD_TYPE_COMPLETE_LOCAL_NAME,  /* name bytes filled in by BLE_BuildDeviceName() */
};

/* USER CODE BEGIN PV */

/* USER CODE END PV */

