simonnkm/Ambiance/Ambiance-main/WPSSource/WildlifeSource/STM32_BLE/App/app_ble.c
/* Private function prototypes -----------------------------------------------*/
static void connection_complete_event(uint8_t Status,
                                      uint16_t Connection_Handle,
                                      uint8_t Peer_Address_Type,
                                      uint8_t Peer_Address[6],
                                      uint16_t Connection_Interval,
                                      uint16_t Peripheral_Latency,
                                      uint16_t Supervision_Timeout);

static void gap_cmd_resp_wait(void);
static void gap_cmd_resp_release(void);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* External variables --------------------------------------------------------*/

/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Private functions ---------------------------------------------------------*/

/* USER CODE BEGIN PF */

/* USER CODE END PF */

/* Functions Definition ------------------------------------------------------*/
void ModulesInit(void)
{
  BLENVM_Init();
  if (PKAMGR_Init() == PKAMGR_ERROR)
  {
    Error_Handler();
  }
}

/**
 * Build a per-unit device name ("Ambiance Speaker XXXXXX") from the chip's
 * factory-programmed 64-bit unique ID (UID64_BASE), and copy it into both
 * the GAP device name characteristic buffer and the advertising data buffer.
 * Must run before Gap_profile_set_dev_name() and before advertising starts.
 */
static void BLE_BuildDeviceName(void)
{
  static const char hex_digits[] = "0123456789ABCDEF";
  const uint32_t uid0 = *(volatile uint32_t *)(UID64_BASE);
  const uint32_t uid1 = *(volatile uint32_t *)(UID64_BASE + 4U);
  /* Fold the 64-bit factory UID down to a 24-bit tag - a much larger name-
   * space than the previous 16-bit version, to make a same-tag collision
   * between two units far less likely (see the comment on
   * GAP_DEVICE_NAME_ID_LEN above). */
  const uint32_t id_tag = (((uid0 * 2654435761U) ^ (uid1 * 2246822519U)) >> 8) & 0xFFFFFFU;
  const size_t prefix_len = sizeof(GAP_DEVICE_NAME_PREFIX) - 1U;

  memcpy(a_GapDeviceName, GAP_DEVICE_NAME_PREFIX, prefix_len);
  a_GapDeviceName[prefix_len + 0U] = (uint8_t)hex_digits[(id_tag >> 20) & 0xFU];
  a_GapDeviceName[prefix_len + 1U] = (uint8_t)hex_digits[(id_tag >> 16) & 0xFU];
  a_GapDeviceName[prefix_len + 2U] = (uint8_t)hex_digits[(id_tag >> 12) & 0xFU];
  a_GapDeviceName[prefix_len + 3U] = (uint8_t)hex_digits[(id_tag >> 8)  & 0xFU];
  a_GapDeviceName[prefix_len + 4U] = (uint8_t)hex_digits[(id_tag >> 4)  & 0xFU];
  a_GapDeviceName[prefix_len + 5U] = (uint8_t)hex_digits[id_tag & 0xFU];

  /* a_AdvData layout: [0..2]=flags block, [3]=len, [4]=AD_TYPE_COMPLETE_LOCAL_NAME, [5..]=name */
  memcpy(&a_AdvData[5], a_GapDeviceName, GAP_DEVICE_NAME_LEN);
}

void BLE_Init(void)
{
  uint8_t role;
  uint8_t privacy_type = 0;
  tBleStatus ret;
  uint16_t gatt_service_changed_handle;
  uint16_t gap_dev_name_char_handle;
  uint16_t gap_appearance_char_handle;
  uint16_t gap_periph_pref_conn_param_char_handle;
  uint8_t bd_address[6] = {0};
  uint8_t bd_address_len= 6;
  uint16_t appearance = CFG_GAP_APPEARANCE;

  BLE_BuildDeviceName();

  BLE_STACK_InitTypeDef BLE_STACK_InitParams = {
    .BLEStartRamAddress = (uint8_t*)dyn_alloc_a,
    .TotalBufferSize = BLE_DYN_ALLOC_SIZE,
    .NumAttrRecords = CFG_BLE_NUM_GATT_ATTRIBUTES,
    .MaxNumOfClientProcs = CFG_BLE_NUM_OF_CONCURRENT_GATT_CLIENT_PROC,
    .NumOfRadioTasks = CFG_BLE_NUM_RADIO_TASKS,
    .NumOfEATTChannels = CFG_BLE_NUM_EATT_CHANNELS,
    .NumBlockCount = CFG_BLE_MBLOCKS_COUNT,
    .ATT_MTU = CFG_BLE_ATT_MTU_MAX,
    .MaxConnEventLength = CFG_BLE_CONN_EVENT_LENGTH_MAX,
    .SleepClockAccuracy = CFG_BLE_SLEEP_CLOCK_ACCURACY,
    .NumOfAdvDataSet = CFG_BLE_NUM_ADV_SETS,
    .NumOfSubeventsPAwR = CFG_BLE_NUM_PAWR_SUBEVENTS,
    .MaxPAwRSubeventDataCount = CFG_BLE_PAWR_SUBEVENT_DATA_COUNT_MAX,
    .NumOfAuxScanSlots = CFG_BLE_NUM_AUX_SCAN_SLOTS,
    .FilterAcceptListSizeLog2 = CFG_BLE_FILTER_ACCEPT_LIST_SIZE_LOG2,
    .L2CAP_MPS = CFG_BLE_COC_MPS_MAX,
    .L2CAP_NumChannels = CFG_BLE_COC_NBR_MAX,
    .NumOfSyncSlots = CFG_BLE_NUM_SYNC_SLOTS,
    .CTE_MaxNumAntennaIDs = CFG_BLE_NUM_CTE_ANTENNA_IDS_MAX,
    .CTE_MaxNumIQSamples = CFG_BLE_NUM_CTE_IQ_SAMPLES_MAX,
    .NumOfSyncBIG = CFG_BLE_NUM_SYNC_BIG_MAX,
    .NumOfBrcBIG = CFG_BLE_NUM_BRC_BIG_MAX,
    .NumOfSyncBIS = CFG_BLE_NUM_SYNC_BIS_MAX,
    .NumOfBrcBIS = CFG_BLE_NUM_BRC_BIS_MAX,
    .NumOfCIG = CFG_BLE_NUM_CIG_MAX,
    .NumOfCIS = CFG_BLE_NUM_CIS_MAX,
    .isr0_fifo_size = CFG_BLE_ISR0_FIFO_SIZE,
    .isr1_fifo_size = CFG_BLE_ISR1_FIFO_SIZE,
    .user_fifo_size = CFG_BLE_USER_FIFO_SIZE
  };

  /* Bluetooth LE stack init */
  ret = BLE_STACK_Init(&BLE_STACK_InitParams);
  if (ret != BLE_STATUS_SUCCESS) {
    APP_DBG_MSG("Error in BLE_STACK_Init() 0x%02x\r\n", ret);
    Error_Handler();
  }

#if (CFG_BD_ADDRESS_TYPE == HCI_ADDR_PUBLIC)

  bd_address[0] = (uint8_t)((CFG_PUBLIC_BD_ADDRESS & 0x0000000000FF));
  bd_address[1] = (uint8_t)((CFG_PUBLIC_BD_ADDRESS & 0x00000000FF00) >> 8);
  bd_address[2] = (uint8_t)((CFG_PUBLIC_BD_ADDRESS & 0x000000FF0000) >> 16);
  bd_address[3] = (uint8_t)((CFG_PUBLIC_BD_ADDRESS & 0x0000FF000000) >> 24);
  bd_address[4] = (uint8_t)((CFG_PUBLIC_BD_ADDRESS & 0x00FF00000000) >> 32);
  bd_address[5] = (uint8_t)((CFG_PUBLIC_BD_ADDRESS & 0xFF0000000000) >> 40);
  (void)bd_address_len;

  ret = aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET, CONFIG_DATA_PUBADDR_LEN, bd_address);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_PUBADDR_OFFSET, result: 0x%02X\n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_hal_write_config_data command - CONFIG_DATA_PUBADDR_OFFSET\n");
  }
#elif (CFG_BD_ADDRESS_TYPE == HCI_ADDR_STATIC_RANDOM_ADDR)
  /* CONFIG_DATA_STORED_STATIC_RANDOM_ADDRESS (read-only) is whatever
   * happens to already be sitting in this chip's BLE-stack NVM region -
   * nothing in this project ever wrote it, so aci_gap_init() below was
   * falling back to that stored value. Every unit gets flashed from the
   * same compiled image, and that NVM region is part of what a normal
   * full-image flash writes, so multiple physical units ended up with the
   * IDENTICAL "static random" address baked in from the build rather than
   * a genuinely unique one - confirmed in the field: two different
   * speakers showed up as a single flickering entry in a BLE scanner,
   * which only happens when they share a BD address.
   *
   * Fix: explicitly set a real per-chip static random address here, via
   * CONFIG_DATA_STATIC_RANDOM_ADDRESS ("to set the static random address
   * used by the stack, INSTEAD OF the one stored in NVM" - see
   * ble_const.h), derived from the same factory-programmed 64-bit UID
   * already used for the device name (BLE_BuildDeviceName above), so it's
   * unique per chip regardless of what the shared image left in NVM.
   * Uses different multipliers than the name-tag hash so the address and
   * the visible name digits aren't trivially correlated. Per the Bluetooth
   * spec, a static random address must have its two most significant bits
   * set to '1' (address[5] is the MSB here, matching the public-address
   * byte order above) - forced via the |0xC0 below. */
  {
    const uint32_t uid0 = *(volatile uint32_t *)(UID64_BASE);
    const uint32_t uid1 = *(volatile uint32_t *)(UID64_BASE + 4U);
    const uint32_t mix0 = (uid0 * 2654435761U) ^ (uid1 * 0x9E3779B1U);
    const uint32_t mix1 = (uid1 * 2246822519U) ^ (uid0 * 0x85EBCA6BU);

